/* automatically generated by rust-bindgen 0.69.4 */

use jni_sys::*;

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {

        kind: jvmtiHeapReferenceKind,
        info: *const jvmtiHeapReferenceInfo,
        object_class_tag: jlong,
        object_tag_ptr: *mut jlong,
        value: jvalue,
        value_type: jvmtiPrimitiveType,
        user_data: *mut ::std::os::raw::c_void,
    ) -> jint,
>;
pub type jvmtiArrayPrimitiveValueCallback = ::std::option::Option<
    unsafe extern "C" fn(
        class_tag: jlong,
        size: jlong,
        tag_ptr: *mut jlong,
        element_count: jint,
        element_type: jvmtiPrimitiveType,
        elements: *const ::std::os::raw::c_void,
        user_data: *mut ::std::os::raw::c_void,
    ) -> jint,
>;
pub type jvmtiStringPrimitiveValueCallback = ::std::option::Option<
    unsafe extern "C" fn(
        class_tag: jlong,
        size: jlong,
        tag_ptr: *mut jlong,
        value: *const jchar,
        value_length: jint,
        user_data: *mut ::std::os::raw::c_void,
    ) -> jint,
>;
pub type jvmtiReservedCallback = ::std::option::Option<unsafe extern "C" fn() -> jint>;
pub type jvmtiHeapObjectCallback = ::std::option::Option<
    unsafe extern "C" fn(
        class_tag: jlong,
        size: jlong,
        tag_ptr: *mut jlong,
        user_data: *mut ::std::os::raw::c_void,
    ) -> jvmtiIterationControl,
>;
pub type jvmtiHeapRootCallback = ::std::option::Option<
    unsafe extern "C" fn(
        root_kind: jvmtiHeapRootKind,
        class_tag: jlong,
        size: jlong,
        tag_ptr: *mut jlong,
        user_data: *mut ::std::os::raw::c_void,
    ) -> jvmtiIterationControl,
>;
pub type jvmtiStackReferenceCallback = ::std::option::Option<
    unsafe extern "C" fn(
        root_kind: jvmtiHeapRootKind,
        class_tag: jlong,
        size: jlong,
        tag_ptr: *mut jlong,
        thread_tag: jlong,
        depth: jint,
        method: jmethodID,
        slot: jint,
        user_data: *mut ::std::os::raw::c_void,
    ) -> jvmtiIterationControl,
>;
pub type jvmtiObjectReferenceCallback = ::std::option::Option<
    unsafe extern "C" fn(
        reference_kind: jvmtiObjectReferenceKind,
        class_tag: jlong,
        size: jlong,
        tag_ptr: *mut jlong,
        referrer_tag: jlong,
        referrer_index: jint,
        user_data: *mut ::std::os::raw::c_void,
    ) -> jvmtiIterationControl,
>;
pub type jvmtiExtensionFunction =
    ::std::option::Option<unsafe extern "C" fn(jvmti_env: *mut jvmtiEnv, ...) -> jvmtiError>;
pub type jvmtiExtensionEvent =
    ::std::option::Option<unsafe extern "C" fn(jvmti_env: *mut jvmtiEnv, ...)>;
#[repr(C)]
pub struct jvmtiThreadInfo {
    pub name: *mut ::std::os::raw::c_char,
    pub priority: jint,
    pub is_daemon: jboolean,
    pub thread_group: jthreadGroup,
    pub context_class_loader: jobject,
}
#[test]
fn bindgen_test_layout_jvmtiThreadInfo() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiThreadInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiThreadInfo>(),
        32usize,
        concat!("Size of: ", stringify!(jvmtiThreadInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiThreadInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiThreadInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiThreadInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priority) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiThreadInfo),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_daemon) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiThreadInfo),
            "::",
            stringify!(is_daemon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thread_group) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiThreadInfo),
            "::",
            stringify!(thread_group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).context_class_loader) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiThreadInfo),
            "::",
            stringify!(context_class_loader)
        )
    );
}
impl Default for jvmtiThreadInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiMonitorStackDepthInfo {
    pub monitor: jobject,
    pub stack_depth: jint,
}
#[test]
fn bindgen_test_layout_jvmtiMonitorStackDepthInfo() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiMonitorStackDepthInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiMonitorStackDepthInfo>(),
        16usize,
        concat!("Size of: ", stringify!(jvmtiMonitorStackDepthInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiMonitorStackDepthInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiMonitorStackDepthInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).monitor) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiMonitorStackDepthInfo),
            "::",
            stringify!(monitor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stack_depth) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiMonitorStackDepthInfo),
            "::",
            stringify!(stack_depth)
        )
    );
}
impl Default for jvmtiMonitorStackDepthInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiThreadGroupInfo {
    pub parent: jthreadGroup,
    pub name: *mut ::std::os::raw::c_char,
    pub max_priority: jint,
    pub is_daemon: jboolean,
}
#[test]
fn bindgen_test_layout_jvmtiThreadGroupInfo() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiThreadGroupInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiThreadGroupInfo>(),
        24usize,
        concat!("Size of: ", stringify!(jvmtiThreadGroupInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiThreadGroupInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiThreadGroupInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiThreadGroupInfo),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiThreadGroupInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_priority) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiThreadGroupInfo),
            "::",
            stringify!(max_priority)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_daemon) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiThreadGroupInfo),
            "::",
            stringify!(is_daemon)
        )
    );
}
impl Default for jvmtiThreadGroupInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiFrameInfo {
    pub method: jmethodID,
    pub location: jlocation,
}
#[test]
fn bindgen_test_layout_jvmtiFrameInfo() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiFrameInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiFrameInfo>(),
        16usize,
        concat!("Size of: ", stringify!(jvmtiFrameInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiFrameInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiFrameInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).method) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiFrameInfo),
            "::",
            stringify!(method)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).location) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiFrameInfo),
            "::",
            stringify!(location)
        )
    );
}
impl Default for jvmtiFrameInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiStackInfo {
    pub thread: jthread,
    pub state: jint,
    pub frame_buffer: *mut jvmtiFrameInfo,
    pub frame_count: jint,
}
#[test]
fn bindgen_test_layout_jvmtiStackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiStackInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiStackInfo>(),
        32usize,
        concat!("Size of: ", stringify!(jvmtiStackInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiStackInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiStackInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thread) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiStackInfo),
            "::",
            stringify!(thread)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiStackInfo),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_buffer) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiStackInfo),
            "::",
            stringify!(frame_buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_count) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiStackInfo),
            "::",
            stringify!(frame_count)
        )
    );
}
impl Default for jvmtiStackInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiHeapReferenceInfoField {
    pub index: jint,
}
#[test]
fn bindgen_test_layout_jvmtiHeapReferenceInfoField() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiHeapReferenceInfoField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiHeapReferenceInfoField>(),
        4usize,
        concat!("Size of: ", stringify!(jvmtiHeapReferenceInfoField))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiHeapReferenceInfoField>(),
        4usize,
        concat!("Alignment of ", stringify!(jvmtiHeapReferenceInfoField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoField),
            "::",
            stringify!(index)
        )
    );
}
impl Default for jvmtiHeapReferenceInfoField {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiHeapReferenceInfoArray {
    pub index: jint,
}
#[test]
fn bindgen_test_layout_jvmtiHeapReferenceInfoArray() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiHeapReferenceInfoArray> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiHeapReferenceInfoArray>(),
        4usize,
        concat!("Size of: ", stringify!(jvmtiHeapReferenceInfoArray))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiHeapReferenceInfoArray>(),
        4usize,
        concat!("Alignment of ", stringify!(jvmtiHeapReferenceInfoArray))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoArray),
            "::",
            stringify!(index)
        )
    );
}
impl Default for jvmtiHeapReferenceInfoArray {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiHeapReferenceInfoConstantPool {
    pub index: jint,
}
#[test]
fn bindgen_test_layout_jvmtiHeapReferenceInfoConstantPool() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiHeapReferenceInfoConstantPool> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiHeapReferenceInfoConstantPool>(),
        4usize,
        concat!("Size of: ", stringify!(jvmtiHeapReferenceInfoConstantPool))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiHeapReferenceInfoConstantPool>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(jvmtiHeapReferenceInfoConstantPool)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoConstantPool),
            "::",
            stringify!(index)
        )
    );
}
impl Default for jvmtiHeapReferenceInfoConstantPool {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiHeapReferenceInfoStackLocal {
    pub thread_tag: jlong,
    pub thread_id: jlong,
    pub depth: jint,
    pub method: jmethodID,
    pub location: jlocation,
    pub slot: jint,
}
#[test]
fn bindgen_test_layout_jvmtiHeapReferenceInfoStackLocal() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiHeapReferenceInfoStackLocal> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiHeapReferenceInfoStackLocal>(),
        48usize,
        concat!("Size of: ", stringify!(jvmtiHeapReferenceInfoStackLocal))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiHeapReferenceInfoStackLocal>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(jvmtiHeapReferenceInfoStackLocal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thread_tag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoStackLocal),
            "::",
            stringify!(thread_tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thread_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoStackLocal),
            "::",
            stringify!(thread_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).depth) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoStackLocal),
            "::",
            stringify!(depth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).method) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoStackLocal),
            "::",
            stringify!(method)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).location) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoStackLocal),
            "::",
            stringify!(location)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoStackLocal),
            "::",
            stringify!(slot)
        )
    );
}
impl Default for jvmtiHeapReferenceInfoStackLocal {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiHeapReferenceInfoJniLocal {
    pub thread_tag: jlong,
    pub thread_id: jlong,
    pub depth: jint,
    pub method: jmethodID,
}
#[test]
fn bindgen_test_layout_jvmtiHeapReferenceInfoJniLocal() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiHeapReferenceInfoJniLocal> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiHeapReferenceInfoJniLocal>(),
        32usize,
        concat!("Size of: ", stringify!(jvmtiHeapReferenceInfoJniLocal))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiHeapReferenceInfoJniLocal>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiHeapReferenceInfoJniLocal))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thread_tag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoJniLocal),
            "::",
            stringify!(thread_tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thread_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoJniLocal),
            "::",
            stringify!(thread_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).depth) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoJniLocal),
            "::",
            stringify!(depth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).method) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoJniLocal),
            "::",
            stringify!(method)
        )
    );
}
impl Default for jvmtiHeapReferenceInfoJniLocal {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiHeapReferenceInfoReserved {
    pub reserved1: jlong,
    pub reserved2: jlong,
    pub reserved3: jlong,
    pub reserved4: jlong,
    pub reserved5: jlong,
    pub reserved6: jlong,
    pub reserved7: jlong,
    pub reserved8: jlong,
}
#[test]
fn bindgen_test_layout_jvmtiHeapReferenceInfoReserved() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiHeapReferenceInfoReserved> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiHeapReferenceInfoReserved>(),
        64usize,
        concat!("Size of: ", stringify!(jvmtiHeapReferenceInfoReserved))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiHeapReferenceInfoReserved>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiHeapReferenceInfoReserved))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoReserved),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoReserved),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved3) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoReserved),
            "::",
            stringify!(reserved3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved4) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoReserved),
            "::",
            stringify!(reserved4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved5) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoReserved),
            "::",
            stringify!(reserved5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved6) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoReserved),
            "::",
            stringify!(reserved6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved7) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoReserved),
            "::",
            stringify!(reserved7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved8) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfoReserved),
            "::",
            stringify!(reserved8)
        )
    );
}
impl Default for jvmtiHeapReferenceInfoReserved {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiHeapReferenceInfo {
    pub field: __BindgenUnionField<jvmtiHeapReferenceInfoField>,
    pub array: __BindgenUnionField<jvmtiHeapReferenceInfoArray>,
    pub constant_pool: __BindgenUnionField<jvmtiHeapReferenceInfoConstantPool>,
    pub stack_local: __BindgenUnionField<jvmtiHeapReferenceInfoStackLocal>,
    pub jni_local: __BindgenUnionField<jvmtiHeapReferenceInfoJniLocal>,
    pub other: __BindgenUnionField<jvmtiHeapReferenceInfoReserved>,
    pub bindgen_union_field: [u64; 8usize],
}
#[test]
fn bindgen_test_layout_jvmtiHeapReferenceInfo() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiHeapReferenceInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiHeapReferenceInfo>(),
        64usize,
        concat!("Size of: ", stringify!(jvmtiHeapReferenceInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiHeapReferenceInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiHeapReferenceInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfo),
            "::",
            stringify!(field)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).array) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfo),
            "::",
            stringify!(array)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).constant_pool) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfo),
            "::",
            stringify!(constant_pool)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stack_local) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfo),
            "::",
            stringify!(stack_local)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jni_local) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfo),
            "::",
            stringify!(jni_local)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).other) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapReferenceInfo),
            "::",
            stringify!(other)
        )
    );
}
impl Default for jvmtiHeapReferenceInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct jvmtiHeapCallbacks {
    pub heap_iteration_callback: jvmtiHeapIterationCallback,
    pub heap_reference_callback: jvmtiHeapReferenceCallback,
    pub primitive_field_callback: jvmtiPrimitiveFieldCallback,
    pub array_primitive_value_callback: jvmtiArrayPrimitiveValueCallback,
    pub string_primitive_value_callback: jvmtiStringPrimitiveValueCallback,
    pub reserved5: jvmtiReservedCallback,
    pub reserved6: jvmtiReservedCallback,
    pub reserved7: jvmtiReservedCallback,
    pub reserved8: jvmtiReservedCallback,
    pub reserved9: jvmtiReservedCallback,
    pub reserved10: jvmtiReservedCallback,
    pub reserved11: jvmtiReservedCallback,
    pub reserved12: jvmtiReservedCallback,
    pub reserved13: jvmtiReservedCallback,
    pub reserved14: jvmtiReservedCallback,
    pub reserved15: jvmtiReservedCallback,
}
#[test]
fn bindgen_test_layout_jvmtiHeapCallbacks() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiHeapCallbacks> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiHeapCallbacks>(),
        128usize,
        concat!("Size of: ", stringify!(jvmtiHeapCallbacks))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiHeapCallbacks>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiHeapCallbacks))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).heap_iteration_callback) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapCallbacks),
            "::",
            stringify!(heap_iteration_callback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).heap_reference_callback) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapCallbacks),
            "::",
            stringify!(heap_reference_callback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).primitive_field_callback) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapCallbacks),
            "::",
            stringify!(primitive_field_callback)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).array_primitive_value_callback) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapCallbacks),
            "::",
            stringify!(array_primitive_value_callback)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).string_primitive_value_callback) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapCallbacks),
            "::",
            stringify!(string_primitive_value_callback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved5) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapCallbacks),
            "::",
            stringify!(reserved5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved6) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapCallbacks),
            "::",
            stringify!(reserved6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved7) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapCallbacks),
            "::",
            stringify!(reserved7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved8) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapCallbacks),
            "::",
            stringify!(reserved8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved9) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapCallbacks),
            "::",
            stringify!(reserved9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved10) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapCallbacks),
            "::",
            stringify!(reserved10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved11) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapCallbacks),
            "::",
            stringify!(reserved11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved12) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapCallbacks),
            "::",
            stringify!(reserved12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved13) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapCallbacks),
            "::",
            stringify!(reserved13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved14) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapCallbacks),
            "::",
            stringify!(reserved14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved15) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiHeapCallbacks),
            "::",
            stringify!(reserved15)
        )
    );
}
#[repr(C)]
pub struct jvmtiClassDefinition {
    pub klass: jclass,
    pub class_byte_count: jint,
    pub class_bytes: *const ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_jvmtiClassDefinition() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiClassDefinition> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiClassDefinition>(),
        24usize,
        concat!("Size of: ", stringify!(jvmtiClassDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiClassDefinition>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiClassDefinition))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).klass) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiClassDefinition),
            "::",
            stringify!(klass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).class_byte_count) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiClassDefinition),
            "::",
            stringify!(class_byte_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).class_bytes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiClassDefinition),
            "::",
            stringify!(class_bytes)
        )
    );
}
impl Default for jvmtiClassDefinition {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiMonitorUsage {
    pub owner: jthread,
    pub entry_count: jint,
    pub waiter_count: jint,
    pub waiters: *mut jthread,
    pub notify_waiter_count: jint,
    pub notify_waiters: *mut jthread,
}
#[test]
fn bindgen_test_layout_jvmtiMonitorUsage() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiMonitorUsage> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiMonitorUsage>(),
        40usize,
        concat!("Size of: ", stringify!(jvmtiMonitorUsage))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiMonitorUsage>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiMonitorUsage))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).owner) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiMonitorUsage),
            "::",
            stringify!(owner)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entry_count) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiMonitorUsage),
            "::",
            stringify!(entry_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).waiter_count) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiMonitorUsage),
            "::",
            stringify!(waiter_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).waiters) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiMonitorUsage),
            "::",
            stringify!(waiters)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).notify_waiter_count) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiMonitorUsage),
            "::",
            stringify!(notify_waiter_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).notify_waiters) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiMonitorUsage),
            "::",
            stringify!(notify_waiters)
        )
    );
}
impl Default for jvmtiMonitorUsage {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiLineNumberEntry {
    pub start_location: jlocation,
    pub line_number: jint,
}
#[test]
fn bindgen_test_layout_jvmtiLineNumberEntry() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiLineNumberEntry> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiLineNumberEntry>(),
        16usize,
        concat!("Size of: ", stringify!(jvmtiLineNumberEntry))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiLineNumberEntry>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiLineNumberEntry))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_location) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiLineNumberEntry),
            "::",
            stringify!(start_location)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).line_number) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiLineNumberEntry),
            "::",
            stringify!(line_number)
        )
    );
}
impl Default for jvmtiLineNumberEntry {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiLocalVariableEntry {
    pub start_location: jlocation,
    pub length: jint,
    pub name: *mut ::std::os::raw::c_char,
    pub signature: *mut ::std::os::raw::c_char,
    pub generic_signature: *mut ::std::os::raw::c_char,
    pub slot: jint,
}
#[test]
fn bindgen_test_layout_jvmtiLocalVariableEntry() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiLocalVariableEntry> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiLocalVariableEntry>(),
        48usize,
        concat!("Size of: ", stringify!(jvmtiLocalVariableEntry))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiLocalVariableEntry>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiLocalVariableEntry))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_location) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiLocalVariableEntry),
            "::",
            stringify!(start_location)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiLocalVariableEntry),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiLocalVariableEntry),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).signature) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiLocalVariableEntry),
            "::",
            stringify!(signature)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).generic_signature) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiLocalVariableEntry),
            "::",
            stringify!(generic_signature)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiLocalVariableEntry),
            "::",
            stringify!(slot)
        )
    );
}
impl Default for jvmtiLocalVariableEntry {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiParamInfo {
    pub name: *mut ::std::os::raw::c_char,
    pub kind: jvmtiParamKind,
    pub base_type: jvmtiParamTypes,
    pub null_ok: jboolean,
}
#[test]
fn bindgen_test_layout_jvmtiParamInfo() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiParamInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiParamInfo>(),
        24usize,
        concat!("Size of: ", stringify!(jvmtiParamInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiParamInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiParamInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiParamInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).kind) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiParamInfo),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).base_type) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiParamInfo),
            "::",
            stringify!(base_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).null_ok) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiParamInfo),
            "::",
            stringify!(null_ok)
        )
    );
}
impl Default for jvmtiParamInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiExtensionFunctionInfo {
    pub func: jvmtiExtensionFunction,
    pub id: *mut ::std::os::raw::c_char,
    pub short_description: *mut ::std::os::raw::c_char,
    pub param_count: jint,
    pub params: *mut jvmtiParamInfo,
    pub error_count: jint,
    pub errors: *mut jvmtiError,
}
#[test]
fn bindgen_test_layout_jvmtiExtensionFunctionInfo() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiExtensionFunctionInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiExtensionFunctionInfo>(),
        56usize,
        concat!("Size of: ", stringify!(jvmtiExtensionFunctionInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiExtensionFunctionInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiExtensionFunctionInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).func) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiExtensionFunctionInfo),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiExtensionFunctionInfo),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).short_description) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiExtensionFunctionInfo),
            "::",
            stringify!(short_description)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_count) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiExtensionFunctionInfo),
            "::",
            stringify!(param_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).params) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiExtensionFunctionInfo),
            "::",
            stringify!(params)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).error_count) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiExtensionFunctionInfo),
            "::",
            stringify!(error_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).errors) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiExtensionFunctionInfo),
            "::",
            stringify!(errors)
        )
    );
}
impl Default for jvmtiExtensionFunctionInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiExtensionEventInfo {
    pub extension_event_index: jint,
    pub id: *mut ::std::os::raw::c_char,
    pub short_description: *mut ::std::os::raw::c_char,
    pub param_count: jint,
    pub params: *mut jvmtiParamInfo,
}
#[test]
fn bindgen_test_layout_jvmtiExtensionEventInfo() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiExtensionEventInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiExtensionEventInfo>(),
        40usize,
        concat!("Size of: ", stringify!(jvmtiExtensionEventInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiExtensionEventInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiExtensionEventInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extension_event_index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiExtensionEventInfo),
            "::",
            stringify!(extension_event_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiExtensionEventInfo),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).short_description) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiExtensionEventInfo),
            "::",
            stringify!(short_description)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_count) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiExtensionEventInfo),
            "::",
            stringify!(param_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).params) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiExtensionEventInfo),
            "::",
            stringify!(params)
        )
    );
}
impl Default for jvmtiExtensionEventInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiTimerInfo {
    pub max_value: jlong,
    pub may_skip_forward: jboolean,
    pub may_skip_backward: jboolean,
    pub kind: jvmtiTimerKind,
    pub reserved1: jlong,
    pub reserved2: jlong,
}
#[test]
fn bindgen_test_layout_jvmtiTimerInfo() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiTimerInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiTimerInfo>(),
        32usize,
        concat!("Size of: ", stringify!(jvmtiTimerInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiTimerInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiTimerInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiTimerInfo),
            "::",
            stringify!(max_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).may_skip_forward) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiTimerInfo),
            "::",
            stringify!(may_skip_forward)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).may_skip_backward) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiTimerInfo),
            "::",
            stringify!(may_skip_backward)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).kind) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiTimerInfo),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiTimerInfo),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiTimerInfo),
            "::",
            stringify!(reserved2)
        )
    );
}
impl Default for jvmtiTimerInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct jvmtiAddrLocationMap {
    pub start_address: *const ::std::os::raw::c_void,
    pub location: jlocation,
}
#[test]
fn bindgen_test_layout_jvmtiAddrLocationMap() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiAddrLocationMap> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiAddrLocationMap>(),
        16usize,
        concat!("Size of: ", stringify!(jvmtiAddrLocationMap))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiAddrLocationMap>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiAddrLocationMap))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_address) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiAddrLocationMap),
            "::",
            stringify!(start_address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).location) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiAddrLocationMap),
            "::",
            stringify!(location)
        )
    );
}
impl Default for jvmtiAddrLocationMap {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Default, Copy, Clone)]
pub struct jvmtiCapabilities {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 16usize]>,
}
#[test]
fn bindgen_test_layout_jvmtiCapabilities() {
    assert_eq!(
        ::std::mem::size_of::<jvmtiCapabilities>(),
        16usize,
        concat!("Size of: ", stringify!(jvmtiCapabilities))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiCapabilities>(),
        4usize,
        concat!("Alignment of ", stringify!(jvmtiCapabilities))
    );
}
impl jvmtiCapabilities {
    #[inline]
    pub fn can_tag_objects(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_tag_objects(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_field_modification_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_field_modification_events(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_field_access_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_field_access_events(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_get_bytecodes(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_get_bytecodes(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_get_synthetic_attribute(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_get_synthetic_attribute(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_get_owned_monitor_info(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_get_owned_monitor_info(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_get_current_contended_monitor(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_get_current_contended_monitor(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_get_monitor_info(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_get_monitor_info(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_pop_frame(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_pop_frame(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_redefine_classes(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_redefine_classes(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_signal_thread(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_signal_thread(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_get_source_file_name(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_get_source_file_name(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_get_line_numbers(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_get_line_numbers(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_get_source_debug_extension(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_get_source_debug_extension(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_access_local_variables(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_access_local_variables(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_maintain_original_method_order(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_maintain_original_method_order(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_single_step_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_single_step_events(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_exception_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_exception_events(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_frame_pop_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_frame_pop_events(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_breakpoint_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_breakpoint_events(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_suspend(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_suspend(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_redefine_any_class(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_redefine_any_class(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_get_current_thread_cpu_time(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_get_current_thread_cpu_time(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(22usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_get_thread_cpu_time(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_get_thread_cpu_time(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_method_entry_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_method_entry_events(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_method_exit_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(25usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_method_exit_events(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(25usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_all_class_hook_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(26usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_all_class_hook_events(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(26usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_compiled_method_load_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_compiled_method_load_events(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_monitor_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_monitor_events(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_vm_object_alloc_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_vm_object_alloc_events(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_native_method_bind_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_native_method_bind_events(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_garbage_collection_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_garbage_collection_events(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_object_free_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_object_free_events(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_force_early_return(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(33usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_force_early_return(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(33usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_get_owned_monitor_stack_depth_info(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(34usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_get_owned_monitor_stack_depth_info(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(34usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_get_constant_pool(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(35usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_get_constant_pool(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(35usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_set_native_method_prefix(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(36usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_set_native_method_prefix(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(36usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_retransform_classes(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(37usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_retransform_classes(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(37usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_retransform_any_class(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(38usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_retransform_any_class(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(38usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_resource_exhaustion_heap_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(39usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_resource_exhaustion_heap_events(
        &mut self,
        val: ::std::os::raw::c_uint,
    ) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(39usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_resource_exhaustion_threads_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(40usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_resource_exhaustion_threads_events(
        &mut self,
        val: ::std::os::raw::c_uint,
    ) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(40usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_early_vmstart(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(41usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_early_vmstart(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(41usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_early_class_hook_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(42usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_early_class_hook_events(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(42usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_generate_sampled_object_alloc_events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(43usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_generate_sampled_object_alloc_events(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(43usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn can_support_virtual_threads(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(44usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_support_virtual_threads(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(44usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        can_tag_objects: ::std::os::raw::c_uint,
        can_generate_field_modification_events: ::std::os::raw::c_uint,
        can_generate_field_access_events: ::std::os::raw::c_uint,
        can_get_bytecodes: ::std::os::raw::c_uint,
        can_get_synthetic_attribute: ::std::os::raw::c_uint,
        can_get_owned_monitor_info: ::std::os::raw::c_uint,
        can_get_current_contended_monitor: ::std::os::raw::c_uint,
        can_get_monitor_info: ::std::os::raw::c_uint,
        can_pop_frame: ::std::os::raw::c_uint,
        can_redefine_classes: ::std::os::raw::c_uint,
        can_signal_thread: ::std::os::raw::c_uint,
        can_get_source_file_name: ::std::os::raw::c_uint,
        can_get_line_numbers: ::std::os::raw::c_uint,
        can_get_source_debug_extension: ::std::os::raw::c_uint,
        can_access_local_variables: ::std::os::raw::c_uint,
        can_maintain_original_method_order: ::std::os::raw::c_uint,
        can_generate_single_step_events: ::std::os::raw::c_uint,
        can_generate_exception_events: ::std::os::raw::c_uint,
        can_generate_frame_pop_events: ::std::os::raw::c_uint,
        can_generate_breakpoint_events: ::std::os::raw::c_uint,
        can_suspend: ::std::os::raw::c_uint,
        can_redefine_any_class: ::std::os::raw::c_uint,
        can_get_current_thread_cpu_time: ::std::os::raw::c_uint,
        can_get_thread_cpu_time: ::std::os::raw::c_uint,
        can_generate_method_entry_events: ::std::os::raw::c_uint,
        can_generate_method_exit_events: ::std::os::raw::c_uint,
        can_generate_all_class_hook_events: ::std::os::raw::c_uint,
        can_generate_compiled_method_load_events: ::std::os::raw::c_uint,
        can_generate_monitor_events: ::std::os::raw::c_uint,
        can_generate_vm_object_alloc_events: ::std::os::raw::c_uint,
        can_generate_native_method_bind_events: ::std::os::raw::c_uint,
        can_generate_garbage_collection_events: ::std::os::raw::c_uint,
        can_generate_object_free_events: ::std::os::raw::c_uint,
        can_force_early_return: ::std::os::raw::c_uint,
        can_get_owned_monitor_stack_depth_info: ::std::os::raw::c_uint,
        can_get_constant_pool: ::std::os::raw::c_uint,
        can_set_native_method_prefix: ::std::os::raw::c_uint,
        can_retransform_classes: ::std::os::raw::c_uint,
        can_retransform_any_class: ::std::os::raw::c_uint,
        can_generate_resource_exhaustion_heap_events: ::std::os::raw::c_uint,
        can_generate_resource_exhaustion_threads_events: ::std::os::raw::c_uint,
        can_generate_early_vmstart: ::std::os::raw::c_uint,
        can_generate_early_class_hook_events: ::std::os::raw::c_uint,
        can_generate_sampled_object_alloc_events: ::std::os::raw::c_uint,
        can_support_virtual_threads: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 16usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 16usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let can_tag_objects: u32 = unsafe { ::std::mem::transmute(can_tag_objects) };
            can_tag_objects as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let can_generate_field_modification_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_field_modification_events) };
            can_generate_field_modification_events as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let can_generate_field_access_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_field_access_events) };
            can_generate_field_access_events as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let can_get_bytecodes: u32 = unsafe { ::std::mem::transmute(can_get_bytecodes) };
            can_get_bytecodes as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let can_get_synthetic_attribute: u32 =
                unsafe { ::std::mem::transmute(can_get_synthetic_attribute) };
            can_get_synthetic_attribute as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let can_get_owned_monitor_info: u32 =
                unsafe { ::std::mem::transmute(can_get_owned_monitor_info) };
            can_get_owned_monitor_info as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let can_get_current_contended_monitor: u32 =
                unsafe { ::std::mem::transmute(can_get_current_contended_monitor) };
            can_get_current_contended_monitor as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let can_get_monitor_info: u32 = unsafe { ::std::mem::transmute(can_get_monitor_info) };
            can_get_monitor_info as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let can_pop_frame: u32 = unsafe { ::std::mem::transmute(can_pop_frame) };
            can_pop_frame as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let can_redefine_classes: u32 = unsafe { ::std::mem::transmute(can_redefine_classes) };
            can_redefine_classes as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let can_signal_thread: u32 = unsafe { ::std::mem::transmute(can_signal_thread) };
            can_signal_thread as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let can_get_source_file_name: u32 =
                unsafe { ::std::mem::transmute(can_get_source_file_name) };
            can_get_source_file_name as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let can_get_line_numbers: u32 = unsafe { ::std::mem::transmute(can_get_line_numbers) };
            can_get_line_numbers as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let can_get_source_debug_extension: u32 =
                unsafe { ::std::mem::transmute(can_get_source_debug_extension) };
            can_get_source_debug_extension as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let can_access_local_variables: u32 =
                unsafe { ::std::mem::transmute(can_access_local_variables) };
            can_access_local_variables as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let can_maintain_original_method_order: u32 =
                unsafe { ::std::mem::transmute(can_maintain_original_method_order) };
            can_maintain_original_method_order as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let can_generate_single_step_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_single_step_events) };
            can_generate_single_step_events as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let can_generate_exception_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_exception_events) };
            can_generate_exception_events as u64
        });
        __bindgen_bitfield_unit.set(18usize, 1u8, {
            let can_generate_frame_pop_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_frame_pop_events) };
            can_generate_frame_pop_events as u64
        });
        __bindgen_bitfield_unit.set(19usize, 1u8, {
            let can_generate_breakpoint_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_breakpoint_events) };
            can_generate_breakpoint_events as u64
        });
        __bindgen_bitfield_unit.set(20usize, 1u8, {
            let can_suspend: u32 = unsafe { ::std::mem::transmute(can_suspend) };
            can_suspend as u64
        });
        __bindgen_bitfield_unit.set(21usize, 1u8, {
            let can_redefine_any_class: u32 =
                unsafe { ::std::mem::transmute(can_redefine_any_class) };
            can_redefine_any_class as u64
        });
        __bindgen_bitfield_unit.set(22usize, 1u8, {
            let can_get_current_thread_cpu_time: u32 =
                unsafe { ::std::mem::transmute(can_get_current_thread_cpu_time) };
            can_get_current_thread_cpu_time as u64
        });
        __bindgen_bitfield_unit.set(23usize, 1u8, {
            let can_get_thread_cpu_time: u32 =
                unsafe { ::std::mem::transmute(can_get_thread_cpu_time) };
            can_get_thread_cpu_time as u64
        });
        __bindgen_bitfield_unit.set(24usize, 1u8, {
            let can_generate_method_entry_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_method_entry_events) };
            can_generate_method_entry_events as u64
        });
        __bindgen_bitfield_unit.set(25usize, 1u8, {
            let can_generate_method_exit_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_method_exit_events) };
            can_generate_method_exit_events as u64
        });
        __bindgen_bitfield_unit.set(26usize, 1u8, {
            let can_generate_all_class_hook_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_all_class_hook_events) };
            can_generate_all_class_hook_events as u64
        });
        __bindgen_bitfield_unit.set(27usize, 1u8, {
            let can_generate_compiled_method_load_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_compiled_method_load_events) };
            can_generate_compiled_method_load_events as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let can_generate_monitor_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_monitor_events) };
            can_generate_monitor_events as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let can_generate_vm_object_alloc_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_vm_object_alloc_events) };
            can_generate_vm_object_alloc_events as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let can_generate_native_method_bind_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_native_method_bind_events) };
            can_generate_native_method_bind_events as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let can_generate_garbage_collection_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_garbage_collection_events) };
            can_generate_garbage_collection_events as u64
        });
        __bindgen_bitfield_unit.set(32usize, 1u8, {
            let can_generate_object_free_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_object_free_events) };
            can_generate_object_free_events as u64
        });
        __bindgen_bitfield_unit.set(33usize, 1u8, {
            let can_force_early_return: u32 =
                unsafe { ::std::mem::transmute(can_force_early_return) };
            can_force_early_return as u64
        });
        __bindgen_bitfield_unit.set(34usize, 1u8, {
            let can_get_owned_monitor_stack_depth_info: u32 =
                unsafe { ::std::mem::transmute(can_get_owned_monitor_stack_depth_info) };
            can_get_owned_monitor_stack_depth_info as u64
        });
        __bindgen_bitfield_unit.set(35usize, 1u8, {
            let can_get_constant_pool: u32 =
                unsafe { ::std::mem::transmute(can_get_constant_pool) };
            can_get_constant_pool as u64
        });
        __bindgen_bitfield_unit.set(36usize, 1u8, {
            let can_set_native_method_prefix: u32 =
                unsafe { ::std::mem::transmute(can_set_native_method_prefix) };
            can_set_native_method_prefix as u64
        });
        __bindgen_bitfield_unit.set(37usize, 1u8, {
            let can_retransform_classes: u32 =
                unsafe { ::std::mem::transmute(can_retransform_classes) };
            can_retransform_classes as u64
        });
        __bindgen_bitfield_unit.set(38usize, 1u8, {
            let can_retransform_any_class: u32 =
                unsafe { ::std::mem::transmute(can_retransform_any_class) };
            can_retransform_any_class as u64
        });
        __bindgen_bitfield_unit.set(39usize, 1u8, {
            let can_generate_resource_exhaustion_heap_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_resource_exhaustion_heap_events) };
            can_generate_resource_exhaustion_heap_events as u64
        });
        __bindgen_bitfield_unit.set(40usize, 1u8, {
            let can_generate_resource_exhaustion_threads_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_resource_exhaustion_threads_events) };
            can_generate_resource_exhaustion_threads_events as u64
        });
        __bindgen_bitfield_unit.set(41usize, 1u8, {
            let can_generate_early_vmstart: u32 =
                unsafe { ::std::mem::transmute(can_generate_early_vmstart) };
            can_generate_early_vmstart as u64
        });
        __bindgen_bitfield_unit.set(42usize, 1u8, {
            let can_generate_early_class_hook_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_early_class_hook_events) };
            can_generate_early_class_hook_events as u64
        });
        __bindgen_bitfield_unit.set(43usize, 1u8, {
            let can_generate_sampled_object_alloc_events: u32 =
                unsafe { ::std::mem::transmute(can_generate_sampled_object_alloc_events) };
            can_generate_sampled_object_alloc_events as u64
        });
        __bindgen_bitfield_unit.set(44usize, 1u8, {
            let can_support_virtual_threads: u32 =
                unsafe { ::std::mem::transmute(can_support_virtual_threads) };
            can_support_virtual_threads as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type jvmtiEventReserved = ::std::option::Option<unsafe extern "C" fn()>;
pub type jvmtiEventBreakpoint = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        thread: jthread,
        method: jmethodID,
        location: jlocation,
    ),
>;
pub type jvmtiEventClassFileLoadHook = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        class_being_redefined: jclass,
        loader: jobject,
        name: *const ::std::os::raw::c_char,
        protection_domain: jobject,
        class_data_len: jint,
        class_data: *const ::std::os::raw::c_uchar,
        new_class_data_len: *mut jint,
        new_class_data: *mut *mut ::std::os::raw::c_uchar,
    ),
>;
pub type jvmtiEventClassLoad = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        thread: jthread,
        klass: jclass,
    ),
>;
pub type jvmtiEventClassPrepare = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        thread: jthread,
        klass: jclass,
    ),
>;
pub type jvmtiEventCompiledMethodLoad = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        method: jmethodID,
        code_size: jint,
        code_addr: *const ::std::os::raw::c_void,
        map_length: jint,
        map: *const jvmtiAddrLocationMap,
        compile_info: *const ::std::os::raw::c_void,
    ),
>;
pub type jvmtiEventCompiledMethodUnload = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        method: jmethodID,
        code_addr: *const ::std::os::raw::c_void,
    ),
>;
pub type jvmtiEventDataDumpRequest =
    ::std::option::Option<unsafe extern "C" fn(jvmti_env: *mut jvmtiEnv)>;
pub type jvmtiEventDynamicCodeGenerated = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        name: *const ::std::os::raw::c_char,
        address: *const ::std::os::raw::c_void,
        length: jint,
    ),
>;
pub type jvmtiEventException = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        thread: jthread,
        method: jmethodID,
        location: jlocation,
        exception: jobject,
        catch_method: jmethodID,
        catch_location: jlocation,
    ),
>;
pub type jvmtiEventExceptionCatch = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        thread: jthread,
        method: jmethodID,
        location: jlocation,
        exception: jobject,
    ),
>;
pub type jvmtiEventFieldAccess = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        thread: jthread,
        method: jmethodID,
        location: jlocation,
        field_klass: jclass,
        object: jobject,
        field: jfieldID,
    ),
>;
pub type jvmtiEventFieldModification = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        thread: jthread,
        method: jmethodID,
        location: jlocation,
        field_klass: jclass,
        object: jobject,
        field: jfieldID,
        signature_type: ::std::os::raw::c_char,
        new_value: jvalue,
    ),
>;
pub type jvmtiEventFramePop = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        thread: jthread,
        method: jmethodID,
        was_popped_by_exception: jboolean,
    ),
>;
pub type jvmtiEventGarbageCollectionFinish =
    ::std::option::Option<unsafe extern "C" fn(jvmti_env: *mut jvmtiEnv)>;
pub type jvmtiEventGarbageCollectionStart =
    ::std::option::Option<unsafe extern "C" fn(jvmti_env: *mut jvmtiEnv)>;
pub type jvmtiEventMethodEntry = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        thread: jthread,
        method: jmethodID,
    ),
>;
pub type jvmtiEventMethodExit = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        thread: jthread,
        method: jmethodID,
        was_popped_by_exception: jboolean,
        return_value: jvalue,
    ),
>;
pub type jvmtiEventMonitorContendedEnter = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        thread: jthread,
        object: jobject,
    ),
>;
pub type jvmtiEventMonitorContendedEntered = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        thread: jthread,
        object: jobject,
    ),
>;
pub type jvmtiEventMonitorWait = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        thread: jthread,
        object: jobject,
        timeout: jlong,
    ),
>;
pub type jvmtiEventMonitorWaited = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        thread: jthread,
        object: jobject,
        timed_out: jboolean,
    ),
>;
pub type jvmtiEventNativeMethodBind = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        thread: jthread,
        method: jmethodID,
        address: *mut ::std::os::raw::c_void,
        new_address_ptr: *mut *mut ::std::os::raw::c_void,
    ),
>;
pub type jvmtiEventObjectFree =
    ::std::option::Option<unsafe extern "C" fn(jvmti_env: *mut jvmtiEnv, tag: jlong)>;
pub type jvmtiEventResourceExhausted = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        flags: jint,
        reserved: *const ::std::os::raw::c_void,
        description: *const ::std::os::raw::c_char,
    ),
>;
pub type jvmtiEventSampledObjectAlloc = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        thread: jthread,
        object: jobject,
        object_klass: jclass,
        size: jlong,
    ),
>;
pub type jvmtiEventSingleStep = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        thread: jthread,
        method: jmethodID,
        location: jlocation,
    ),
>;
pub type jvmtiEventThreadEnd = ::std::option::Option<
    unsafe extern "C" fn(jvmti_env: *mut jvmtiEnv, jni_env: *mut JNIEnv, thread: jthread),
>;
pub type jvmtiEventThreadStart = ::std::option::Option<
    unsafe extern "C" fn(jvmti_env: *mut jvmtiEnv, jni_env: *mut JNIEnv, thread: jthread),
>;
pub type jvmtiEventVirtualThreadEnd = ::std::option::Option<
    unsafe extern "C" fn(jvmti_env: *mut jvmtiEnv, jni_env: *mut JNIEnv, virtual_thread: jthread),
>;
pub type jvmtiEventVirtualThreadStart = ::std::option::Option<
    unsafe extern "C" fn(jvmti_env: *mut jvmtiEnv, jni_env: *mut JNIEnv, virtual_thread: jthread),
>;
pub type jvmtiEventVMDeath =
    ::std::option::Option<unsafe extern "C" fn(jvmti_env: *mut jvmtiEnv, jni_env: *mut JNIEnv)>;
pub type jvmtiEventVMInit = ::std::option::Option<
    unsafe extern "C" fn(jvmti_env: *mut jvmtiEnv, jni_env: *mut JNIEnv, thread: jthread),
>;
pub type jvmtiEventVMObjectAlloc = ::std::option::Option<
    unsafe extern "C" fn(
        jvmti_env: *mut jvmtiEnv,
        jni_env: *mut JNIEnv,
        thread: jthread,
        object: jobject,
        object_klass: jclass,
        size: jlong,
    ),
>;
pub type jvmtiEventVMStart =
    ::std::option::Option<unsafe extern "C" fn(jvmti_env: *mut jvmtiEnv, jni_env: *mut JNIEnv)>;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct jvmtiEventCallbacks {
    pub VMInit: jvmtiEventVMInit,
    pub VMDeath: jvmtiEventVMDeath,
    pub ThreadStart: jvmtiEventThreadStart,
    pub ThreadEnd: jvmtiEventThreadEnd,
    pub ClassFileLoadHook: jvmtiEventClassFileLoadHook,
    pub ClassLoad: jvmtiEventClassLoad,
    pub ClassPrepare: jvmtiEventClassPrepare,
    pub VMStart: jvmtiEventVMStart,
    pub Exception: jvmtiEventException,
    pub ExceptionCatch: jvmtiEventExceptionCatch,
    pub SingleStep: jvmtiEventSingleStep,
    pub FramePop: jvmtiEventFramePop,
    pub Breakpoint: jvmtiEventBreakpoint,
    pub FieldAccess: jvmtiEventFieldAccess,
    pub FieldModification: jvmtiEventFieldModification,
    pub MethodEntry: jvmtiEventMethodEntry,
    pub MethodExit: jvmtiEventMethodExit,
    pub NativeMethodBind: jvmtiEventNativeMethodBind,
    pub CompiledMethodLoad: jvmtiEventCompiledMethodLoad,
    pub CompiledMethodUnload: jvmtiEventCompiledMethodUnload,
    pub DynamicCodeGenerated: jvmtiEventDynamicCodeGenerated,
    pub DataDumpRequest: jvmtiEventDataDumpRequest,
    pub reserved72: jvmtiEventReserved,
    pub MonitorWait: jvmtiEventMonitorWait,
    pub MonitorWaited: jvmtiEventMonitorWaited,
    pub MonitorContendedEnter: jvmtiEventMonitorContendedEnter,
    pub MonitorContendedEntered: jvmtiEventMonitorContendedEntered,
    pub reserved77: jvmtiEventReserved,
    pub reserved78: jvmtiEventReserved,
    pub reserved79: jvmtiEventReserved,
    pub ResourceExhausted: jvmtiEventResourceExhausted,
    pub GarbageCollectionStart: jvmtiEventGarbageCollectionStart,
    pub GarbageCollectionFinish: jvmtiEventGarbageCollectionFinish,
    pub ObjectFree: jvmtiEventObjectFree,
    pub VMObjectAlloc: jvmtiEventVMObjectAlloc,
    pub reserved85: jvmtiEventReserved,
    pub SampledObjectAlloc: jvmtiEventSampledObjectAlloc,
    pub VirtualThreadStart: jvmtiEventVirtualThreadStart,
    pub VirtualThreadEnd: jvmtiEventVirtualThreadEnd,
}
#[test]
fn bindgen_test_layout_jvmtiEventCallbacks() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiEventCallbacks> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiEventCallbacks>(),
        312usize,
        concat!("Size of: ", stringify!(jvmtiEventCallbacks))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiEventCallbacks>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiEventCallbacks))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VMInit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(VMInit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VMDeath) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(VMDeath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ThreadStart) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(ThreadStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ThreadEnd) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(ThreadEnd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClassFileLoadHook) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(ClassFileLoadHook)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClassLoad) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(ClassLoad)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClassPrepare) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(ClassPrepare)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VMStart) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(VMStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Exception) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(Exception)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExceptionCatch) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(ExceptionCatch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SingleStep) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(SingleStep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FramePop) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(FramePop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Breakpoint) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(Breakpoint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FieldAccess) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(FieldAccess)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FieldModification) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(FieldModification)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MethodEntry) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(MethodEntry)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MethodExit) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(MethodExit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NativeMethodBind) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(NativeMethodBind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CompiledMethodLoad) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(CompiledMethodLoad)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CompiledMethodUnload) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(CompiledMethodUnload)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DynamicCodeGenerated) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(DynamicCodeGenerated)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DataDumpRequest) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(DataDumpRequest)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved72) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(reserved72)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MonitorWait) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(MonitorWait)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MonitorWaited) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(MonitorWaited)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MonitorContendedEnter) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(MonitorContendedEnter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MonitorContendedEntered) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(MonitorContendedEntered)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved77) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(reserved77)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved78) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(reserved78)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved79) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(reserved79)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResourceExhausted) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(ResourceExhausted)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GarbageCollectionStart) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(GarbageCollectionStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GarbageCollectionFinish) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(GarbageCollectionFinish)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ObjectFree) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(ObjectFree)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VMObjectAlloc) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(VMObjectAlloc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved85) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(reserved85)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SampledObjectAlloc) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(SampledObjectAlloc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VirtualThreadStart) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(VirtualThreadStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VirtualThreadEnd) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiEventCallbacks),
            "::",
            stringify!(VirtualThreadEnd)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct jvmtiInterface_1_ {
    pub reserved1: *mut ::std::os::raw::c_void,
    pub SetEventNotificationMode: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            mode: jvmtiEventMode,
            event_type: jvmtiEvent,
            event_thread: jthread,
            ...
        ) -> jvmtiError,
    >,
    pub GetAllModules: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            module_count_ptr: *mut jint,
            modules_ptr: *mut *mut jobject,
        ) -> jvmtiError,
    >,
    pub GetAllThreads: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            threads_count_ptr: *mut jint,
            threads_ptr: *mut *mut jthread,
        ) -> jvmtiError,
    >,
    pub SuspendThread: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, thread: jthread) -> jvmtiError,
    >,
    pub ResumeThread: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, thread: jthread) -> jvmtiError,
    >,
    pub StopThread: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, thread: jthread, exception: jobject) -> jvmtiError,
    >,
    pub InterruptThread: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, thread: jthread) -> jvmtiError,
    >,
    pub GetThreadInfo: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            info_ptr: *mut jvmtiThreadInfo,
        ) -> jvmtiError,
    >,
    pub GetOwnedMonitorInfo: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            owned_monitor_count_ptr: *mut jint,
            owned_monitors_ptr: *mut *mut jobject,
        ) -> jvmtiError,
    >,
    pub GetCurrentContendedMonitor: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            monitor_ptr: *mut jobject,
        ) -> jvmtiError,
    >,
    pub RunAgentThread: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            proc_: jvmtiStartFunction,
            arg: *const ::std::os::raw::c_void,
            priority: jint,
        ) -> jvmtiError,
    >,
    pub GetTopThreadGroups: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            group_count_ptr: *mut jint,
            groups_ptr: *mut *mut jthreadGroup,
        ) -> jvmtiError,
    >,
    pub GetThreadGroupInfo: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            group: jthreadGroup,
            info_ptr: *mut jvmtiThreadGroupInfo,
        ) -> jvmtiError,
    >,
    pub GetThreadGroupChildren: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            group: jthreadGroup,
            thread_count_ptr: *mut jint,
            threads_ptr: *mut *mut jthread,
            group_count_ptr: *mut jint,
            groups_ptr: *mut *mut jthreadGroup,
        ) -> jvmtiError,
    >,
    pub GetFrameCount: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            count_ptr: *mut jint,
        ) -> jvmtiError,
    >,
    pub GetThreadState: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            thread_state_ptr: *mut jint,
        ) -> jvmtiError,
    >,
    pub GetCurrentThread: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, thread_ptr: *mut jthread) -> jvmtiError,
    >,
    pub GetFrameLocation: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            depth: jint,
            method_ptr: *mut jmethodID,
            location_ptr: *mut jlocation,
        ) -> jvmtiError,
    >,
    pub NotifyFramePop: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, thread: jthread, depth: jint) -> jvmtiError,
    >,
    pub GetLocalObject: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            depth: jint,
            slot: jint,
            value_ptr: *mut jobject,
        ) -> jvmtiError,
    >,
    pub GetLocalInt: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            depth: jint,
            slot: jint,
            value_ptr: *mut jint,
        ) -> jvmtiError,
    >,
    pub GetLocalLong: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            depth: jint,
            slot: jint,
            value_ptr: *mut jlong,
        ) -> jvmtiError,
    >,
    pub GetLocalFloat: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            depth: jint,
            slot: jint,
            value_ptr: *mut jfloat,
        ) -> jvmtiError,
    >,
    pub GetLocalDouble: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            depth: jint,
            slot: jint,
            value_ptr: *mut jdouble,
        ) -> jvmtiError,
    >,
    pub SetLocalObject: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            depth: jint,
            slot: jint,
            value: jobject,
        ) -> jvmtiError,
    >,
    pub SetLocalInt: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            depth: jint,
            slot: jint,
            value: jint,
        ) -> jvmtiError,
    >,
    pub SetLocalLong: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            depth: jint,
            slot: jint,
            value: jlong,
        ) -> jvmtiError,
    >,
    pub SetLocalFloat: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            depth: jint,
            slot: jint,
            value: jfloat,
        ) -> jvmtiError,
    >,
    pub SetLocalDouble: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            depth: jint,
            slot: jint,
            value: jdouble,
        ) -> jvmtiError,
    >,
    pub CreateRawMonitor: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            name: *const ::std::os::raw::c_char,
            monitor_ptr: *mut jrawMonitorID,
        ) -> jvmtiError,
    >,
    pub DestroyRawMonitor: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, monitor: jrawMonitorID) -> jvmtiError,
    >,
    pub RawMonitorEnter: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, monitor: jrawMonitorID) -> jvmtiError,
    >,
    pub RawMonitorExit: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, monitor: jrawMonitorID) -> jvmtiError,
    >,
    pub RawMonitorWait: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            monitor: jrawMonitorID,
            millis: jlong,
        ) -> jvmtiError,
    >,
    pub RawMonitorNotify: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, monitor: jrawMonitorID) -> jvmtiError,
    >,
    pub RawMonitorNotifyAll: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, monitor: jrawMonitorID) -> jvmtiError,
    >,
    pub SetBreakpoint: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            method: jmethodID,
            location: jlocation,
        ) -> jvmtiError,
    >,
    pub ClearBreakpoint: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            method: jmethodID,
            location: jlocation,
        ) -> jvmtiError,
    >,
    pub GetNamedModule: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            class_loader: jobject,
            package_name: *const ::std::os::raw::c_char,
            module_ptr: *mut jobject,
        ) -> jvmtiError,
    >,
    pub SetFieldAccessWatch: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, klass: jclass, field: jfieldID) -> jvmtiError,
    >,
    pub ClearFieldAccessWatch: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, klass: jclass, field: jfieldID) -> jvmtiError,
    >,
    pub SetFieldModificationWatch: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, klass: jclass, field: jfieldID) -> jvmtiError,
    >,
    pub ClearFieldModificationWatch: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, klass: jclass, field: jfieldID) -> jvmtiError,
    >,
    pub IsModifiableClass: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            is_modifiable_class_ptr: *mut jboolean,
        ) -> jvmtiError,
    >,
    pub Allocate: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            size: jlong,
            mem_ptr: *mut *mut ::std::os::raw::c_uchar,
        ) -> jvmtiError,
    >,
    pub Deallocate: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, mem: *mut ::std::os::raw::c_uchar) -> jvmtiError,
    >,
    pub GetClassSignature: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            signature_ptr: *mut *mut ::std::os::raw::c_char,
            generic_ptr: *mut *mut ::std::os::raw::c_char,
        ) -> jvmtiError,
    >,
    pub GetClassStatus: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            status_ptr: *mut jint,
        ) -> jvmtiError,
    >,
    pub GetSourceFileName: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            source_name_ptr: *mut *mut ::std::os::raw::c_char,
        ) -> jvmtiError,
    >,
    pub GetClassModifiers: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            modifiers_ptr: *mut jint,
        ) -> jvmtiError,
    >,
    pub GetClassMethods: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            method_count_ptr: *mut jint,
            methods_ptr: *mut *mut jmethodID,
        ) -> jvmtiError,
    >,
    pub GetClassFields: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            field_count_ptr: *mut jint,
            fields_ptr: *mut *mut jfieldID,
        ) -> jvmtiError,
    >,
    pub GetImplementedInterfaces: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            interface_count_ptr: *mut jint,
            interfaces_ptr: *mut *mut jclass,
        ) -> jvmtiError,
    >,
    pub IsInterface: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            is_interface_ptr: *mut jboolean,
        ) -> jvmtiError,
    >,
    pub IsArrayClass: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            is_array_class_ptr: *mut jboolean,
        ) -> jvmtiError,
    >,
    pub GetClassLoader: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            classloader_ptr: *mut jobject,
        ) -> jvmtiError,
    >,
    pub GetObjectHashCode: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            object: jobject,
            hash_code_ptr: *mut jint,
        ) -> jvmtiError,
    >,
    pub GetObjectMonitorUsage: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            object: jobject,
            info_ptr: *mut jvmtiMonitorUsage,
        ) -> jvmtiError,
    >,
    pub GetFieldName: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            field: jfieldID,
            name_ptr: *mut *mut ::std::os::raw::c_char,
            signature_ptr: *mut *mut ::std::os::raw::c_char,
            generic_ptr: *mut *mut ::std::os::raw::c_char,
        ) -> jvmtiError,
    >,
    pub GetFieldDeclaringClass: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            field: jfieldID,
            declaring_class_ptr: *mut jclass,
        ) -> jvmtiError,
    >,
    pub GetFieldModifiers: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            field: jfieldID,
            modifiers_ptr: *mut jint,
        ) -> jvmtiError,
    >,
    pub IsFieldSynthetic: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            field: jfieldID,
            is_synthetic_ptr: *mut jboolean,
        ) -> jvmtiError,
    >,
    pub GetMethodName: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            method: jmethodID,
            name_ptr: *mut *mut ::std::os::raw::c_char,
            signature_ptr: *mut *mut ::std::os::raw::c_char,
            generic_ptr: *mut *mut ::std::os::raw::c_char,
        ) -> jvmtiError,
    >,
    pub GetMethodDeclaringClass: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            method: jmethodID,
            declaring_class_ptr: *mut jclass,
        ) -> jvmtiError,
    >,
    pub GetMethodModifiers: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            method: jmethodID,
            modifiers_ptr: *mut jint,
        ) -> jvmtiError,
    >,
    pub reserved67: *mut ::std::os::raw::c_void,
    pub GetMaxLocals: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            method: jmethodID,
            max_ptr: *mut jint,
        ) -> jvmtiError,
    >,
    pub GetArgumentsSize: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            method: jmethodID,
            size_ptr: *mut jint,
        ) -> jvmtiError,
    >,
    pub GetLineNumberTable: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            method: jmethodID,
            entry_count_ptr: *mut jint,
            table_ptr: *mut *mut jvmtiLineNumberEntry,
        ) -> jvmtiError,
    >,
    pub GetMethodLocation: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            method: jmethodID,
            start_location_ptr: *mut jlocation,
            end_location_ptr: *mut jlocation,
        ) -> jvmtiError,
    >,
    pub GetLocalVariableTable: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            method: jmethodID,
            entry_count_ptr: *mut jint,
            table_ptr: *mut *mut jvmtiLocalVariableEntry,
        ) -> jvmtiError,
    >,
    pub SetNativeMethodPrefix: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            prefix: *const ::std::os::raw::c_char,
        ) -> jvmtiError,
    >,
    pub SetNativeMethodPrefixes: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            prefix_count: jint,
            prefixes: *mut *mut ::std::os::raw::c_char,
        ) -> jvmtiError,
    >,
    pub GetBytecodes: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            method: jmethodID,
            bytecode_count_ptr: *mut jint,
            bytecodes_ptr: *mut *mut ::std::os::raw::c_uchar,
        ) -> jvmtiError,
    >,
    pub IsMethodNative: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            method: jmethodID,
            is_native_ptr: *mut jboolean,
        ) -> jvmtiError,
    >,
    pub IsMethodSynthetic: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            method: jmethodID,
            is_synthetic_ptr: *mut jboolean,
        ) -> jvmtiError,
    >,
    pub GetLoadedClasses: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            class_count_ptr: *mut jint,
            classes_ptr: *mut *mut jclass,
        ) -> jvmtiError,
    >,
    pub GetClassLoaderClasses: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            initiating_loader: jobject,
            class_count_ptr: *mut jint,
            classes_ptr: *mut *mut jclass,
        ) -> jvmtiError,
    >,
    pub PopFrame: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, thread: jthread) -> jvmtiError,
    >,
    pub ForceEarlyReturnObject: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, thread: jthread, value: jobject) -> jvmtiError,
    >,
    pub ForceEarlyReturnInt: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, thread: jthread, value: jint) -> jvmtiError,
    >,
    pub ForceEarlyReturnLong: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, thread: jthread, value: jlong) -> jvmtiError,
    >,
    pub ForceEarlyReturnFloat: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, thread: jthread, value: jfloat) -> jvmtiError,
    >,
    pub ForceEarlyReturnDouble: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, thread: jthread, value: jdouble) -> jvmtiError,
    >,
    pub ForceEarlyReturnVoid: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, thread: jthread) -> jvmtiError,
    >,
    pub RedefineClasses: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            class_count: jint,
            class_definitions: *const jvmtiClassDefinition,
        ) -> jvmtiError,
    >,
    pub GetVersionNumber: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, version_ptr: *mut jint) -> jvmtiError,
    >,
    pub GetCapabilities: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            capabilities_ptr: *mut jvmtiCapabilities,
        ) -> jvmtiError,
    >,
    pub GetSourceDebugExtension: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            source_debug_extension_ptr: *mut *mut ::std::os::raw::c_char,
        ) -> jvmtiError,
    >,
    pub IsMethodObsolete: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            method: jmethodID,
            is_obsolete_ptr: *mut jboolean,
        ) -> jvmtiError,
    >,
    pub SuspendThreadList: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            request_count: jint,
            request_list: *const jthread,
            results: *mut jvmtiError,
        ) -> jvmtiError,
    >,
    pub ResumeThreadList: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            request_count: jint,
            request_list: *const jthread,
            results: *mut jvmtiError,
        ) -> jvmtiError,
    >,
    pub AddModuleReads: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, module: jobject, to_module: jobject) -> jvmtiError,
    >,
    pub AddModuleExports: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            module: jobject,
            pkg_name: *const ::std::os::raw::c_char,
            to_module: jobject,
        ) -> jvmtiError,
    >,
    pub AddModuleOpens: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            module: jobject,
            pkg_name: *const ::std::os::raw::c_char,
            to_module: jobject,
        ) -> jvmtiError,
    >,
    pub AddModuleUses: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, module: jobject, service: jclass) -> jvmtiError,
    >,
    pub AddModuleProvides: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            module: jobject,
            service: jclass,
            impl_class: jclass,
        ) -> jvmtiError,
    >,
    pub IsModifiableModule: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            module: jobject,
            is_modifiable_module_ptr: *mut jboolean,
        ) -> jvmtiError,
    >,
    pub GetAllStackTraces: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            max_frame_count: jint,
            stack_info_ptr: *mut *mut jvmtiStackInfo,
            thread_count_ptr: *mut jint,
        ) -> jvmtiError,
    >,
    pub GetThreadListStackTraces: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread_count: jint,
            thread_list: *const jthread,
            max_frame_count: jint,
            stack_info_ptr: *mut *mut jvmtiStackInfo,
        ) -> jvmtiError,
    >,
    pub GetThreadLocalStorage: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            data_ptr: *mut *mut ::std::os::raw::c_void,
        ) -> jvmtiError,
    >,
    pub SetThreadLocalStorage: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            data: *const ::std::os::raw::c_void,
        ) -> jvmtiError,
    >,
    pub GetStackTrace: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            start_depth: jint,
            max_frame_count: jint,
            frame_buffer: *mut jvmtiFrameInfo,
            count_ptr: *mut jint,
        ) -> jvmtiError,
    >,
    pub reserved105: *mut ::std::os::raw::c_void,
    pub GetTag: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            object: jobject,
            tag_ptr: *mut jlong,
        ) -> jvmtiError,
    >,
    pub SetTag: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, object: jobject, tag: jlong) -> jvmtiError,
    >,
    pub ForceGarbageCollection:
        ::std::option::Option<unsafe extern "C" fn(env: *mut jvmtiEnv) -> jvmtiError>,
    pub IterateOverObjectsReachableFromObject: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            object: jobject,
            object_reference_callback: jvmtiObjectReferenceCallback,
            user_data: *const ::std::os::raw::c_void,
        ) -> jvmtiError,
    >,
    pub IterateOverReachableObjects: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            heap_root_callback: jvmtiHeapRootCallback,
            stack_ref_callback: jvmtiStackReferenceCallback,
            object_ref_callback: jvmtiObjectReferenceCallback,
            user_data: *const ::std::os::raw::c_void,
        ) -> jvmtiError,
    >,
    pub IterateOverHeap: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            object_filter: jvmtiHeapObjectFilter,
            heap_object_callback: jvmtiHeapObjectCallback,
            user_data: *const ::std::os::raw::c_void,
        ) -> jvmtiError,
    >,
    pub IterateOverInstancesOfClass: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            object_filter: jvmtiHeapObjectFilter,
            heap_object_callback: jvmtiHeapObjectCallback,
            user_data: *const ::std::os::raw::c_void,
        ) -> jvmtiError,
    >,
    pub reserved113: *mut ::std::os::raw::c_void,
    pub GetObjectsWithTags: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            tag_count: jint,
            tags: *const jlong,
            count_ptr: *mut jint,
            object_result_ptr: *mut *mut jobject,
            tag_result_ptr: *mut *mut jlong,
        ) -> jvmtiError,
    >,
    pub FollowReferences: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            heap_filter: jint,
            klass: jclass,
            initial_object: jobject,
            callbacks: *const jvmtiHeapCallbacks,
            user_data: *const ::std::os::raw::c_void,
        ) -> jvmtiError,
    >,
    pub IterateThroughHeap: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            heap_filter: jint,
            klass: jclass,
            callbacks: *const jvmtiHeapCallbacks,
            user_data: *const ::std::os::raw::c_void,
        ) -> jvmtiError,
    >,
    pub reserved117: *mut ::std::os::raw::c_void,
    pub SuspendAllVirtualThreads: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            except_count: jint,
            except_list: *const jthread,
        ) -> jvmtiError,
    >,
    pub ResumeAllVirtualThreads: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            except_count: jint,
            except_list: *const jthread,
        ) -> jvmtiError,
    >,
    pub SetJNIFunctionTable: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            function_table: *const jniNativeInterface,
        ) -> jvmtiError,
    >,
    pub GetJNIFunctionTable: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            function_table: *mut *mut jniNativeInterface,
        ) -> jvmtiError,
    >,
    pub SetEventCallbacks: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            callbacks: *const jvmtiEventCallbacks,
            size_of_callbacks: jint,
        ) -> jvmtiError,
    >,
    pub GenerateEvents: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, event_type: jvmtiEvent) -> jvmtiError,
    >,
    pub GetExtensionFunctions: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            extension_count_ptr: *mut jint,
            extensions: *mut *mut jvmtiExtensionFunctionInfo,
        ) -> jvmtiError,
    >,
    pub GetExtensionEvents: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            extension_count_ptr: *mut jint,
            extensions: *mut *mut jvmtiExtensionEventInfo,
        ) -> jvmtiError,
    >,
    pub SetExtensionEventCallback: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            extension_event_index: jint,
            callback: jvmtiExtensionEvent,
        ) -> jvmtiError,
    >,
    pub DisposeEnvironment:
        ::std::option::Option<unsafe extern "C" fn(env: *mut jvmtiEnv) -> jvmtiError>,
    pub GetErrorName: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            error: jvmtiError,
            name_ptr: *mut *mut ::std::os::raw::c_char,
        ) -> jvmtiError,
    >,
    pub GetJLocationFormat: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            format_ptr: *mut jvmtiJlocationFormat,
        ) -> jvmtiError,
    >,
    pub GetSystemProperties: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            count_ptr: *mut jint,
            property_ptr: *mut *mut *mut ::std::os::raw::c_char,
        ) -> jvmtiError,
    >,
    pub GetSystemProperty: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            property: *const ::std::os::raw::c_char,
            value_ptr: *mut *mut ::std::os::raw::c_char,
        ) -> jvmtiError,
    >,
    pub SetSystemProperty: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            property: *const ::std::os::raw::c_char,
            value_ptr: *const ::std::os::raw::c_char,
        ) -> jvmtiError,
    >,
    pub GetPhase: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, phase_ptr: *mut jvmtiPhase) -> jvmtiError,
    >,
    pub GetCurrentThreadCpuTimerInfo: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, info_ptr: *mut jvmtiTimerInfo) -> jvmtiError,
    >,
    pub GetCurrentThreadCpuTime: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, nanos_ptr: *mut jlong) -> jvmtiError,
    >,
    pub GetThreadCpuTimerInfo: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, info_ptr: *mut jvmtiTimerInfo) -> jvmtiError,
    >,
    pub GetThreadCpuTime: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            nanos_ptr: *mut jlong,
        ) -> jvmtiError,
    >,
    pub GetTimerInfo: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, info_ptr: *mut jvmtiTimerInfo) -> jvmtiError,
    >,
    pub GetTime: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, nanos_ptr: *mut jlong) -> jvmtiError,
    >,
    pub GetPotentialCapabilities: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            capabilities_ptr: *mut jvmtiCapabilities,
        ) -> jvmtiError,
    >,
    pub reserved141: *mut ::std::os::raw::c_void,
    pub AddCapabilities: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            capabilities_ptr: *const jvmtiCapabilities,
        ) -> jvmtiError,
    >,
    pub RelinquishCapabilities: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            capabilities_ptr: *const jvmtiCapabilities,
        ) -> jvmtiError,
    >,
    pub GetAvailableProcessors: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, processor_count_ptr: *mut jint) -> jvmtiError,
    >,
    pub GetClassVersionNumbers: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            minor_version_ptr: *mut jint,
            major_version_ptr: *mut jint,
        ) -> jvmtiError,
    >,
    pub GetConstantPool: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            klass: jclass,
            constant_pool_count_ptr: *mut jint,
            constant_pool_byte_count_ptr: *mut jint,
            constant_pool_bytes_ptr: *mut *mut ::std::os::raw::c_uchar,
        ) -> jvmtiError,
    >,
    pub GetEnvironmentLocalStorage: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            data_ptr: *mut *mut ::std::os::raw::c_void,
        ) -> jvmtiError,
    >,
    pub SetEnvironmentLocalStorage: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, data: *const ::std::os::raw::c_void) -> jvmtiError,
    >,
    pub AddToBootstrapClassLoaderSearch: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            segment: *const ::std::os::raw::c_char,
        ) -> jvmtiError,
    >,
    pub SetVerboseFlag: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            flag: jvmtiVerboseFlag,
            value: jboolean,
        ) -> jvmtiError,
    >,
    pub AddToSystemClassLoaderSearch: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            segment: *const ::std::os::raw::c_char,
        ) -> jvmtiError,
    >,
    pub RetransformClasses: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            class_count: jint,
            classes: *const jclass,
        ) -> jvmtiError,
    >,
    pub GetOwnedMonitorStackDepthInfo: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            monitor_info_count_ptr: *mut jint,
            monitor_info_ptr: *mut *mut jvmtiMonitorStackDepthInfo,
        ) -> jvmtiError,
    >,
    pub GetObjectSize: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            object: jobject,
            size_ptr: *mut jlong,
        ) -> jvmtiError,
    >,
    pub GetLocalInstance: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut jvmtiEnv,
            thread: jthread,
            depth: jint,
            value_ptr: *mut jobject,
        ) -> jvmtiError,
    >,
    pub SetHeapSamplingInterval: ::std::option::Option<
        unsafe extern "C" fn(env: *mut jvmtiEnv, sampling_interval: jint) -> jvmtiError,
    >,
}
#[test]
fn bindgen_test_layout_jvmtiInterface_1_() {
    const UNINIT: ::std::mem::MaybeUninit<jvmtiInterface_1_> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvmtiInterface_1_>(),
        1248usize,
        concat!("Size of: ", stringify!(jvmtiInterface_1_))
    );
    assert_eq!(
        ::std::mem::align_of::<jvmtiInterface_1_>(),
        8usize,
        concat!("Alignment of ", stringify!(jvmtiInterface_1_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEventNotificationMode) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetEventNotificationMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetAllModules) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetAllModules)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetAllThreads) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetAllThreads)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SuspendThread) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SuspendThread)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResumeThread) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(ResumeThread)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).StopThread) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(StopThread)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InterruptThread) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(InterruptThread)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetThreadInfo) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetThreadInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetOwnedMonitorInfo) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetOwnedMonitorInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetCurrentContendedMonitor) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetCurrentContendedMonitor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RunAgentThread) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(RunAgentThread)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetTopThreadGroups) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetTopThreadGroups)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetThreadGroupInfo) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetThreadGroupInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetThreadGroupChildren) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetThreadGroupChildren)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetFrameCount) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetFrameCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetThreadState) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetThreadState)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetCurrentThread) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetCurrentThread)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetFrameLocation) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetFrameLocation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NotifyFramePop) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(NotifyFramePop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetLocalObject) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetLocalObject)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetLocalInt) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetLocalInt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetLocalLong) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetLocalLong)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetLocalFloat) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetLocalFloat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetLocalDouble) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetLocalDouble)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetLocalObject) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetLocalObject)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetLocalInt) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetLocalInt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetLocalLong) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetLocalLong)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetLocalFloat) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetLocalFloat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetLocalDouble) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetLocalDouble)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CreateRawMonitor) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(CreateRawMonitor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DestroyRawMonitor) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(DestroyRawMonitor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RawMonitorEnter) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(RawMonitorEnter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RawMonitorExit) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(RawMonitorExit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RawMonitorWait) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(RawMonitorWait)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RawMonitorNotify) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(RawMonitorNotify)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RawMonitorNotifyAll) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(RawMonitorNotifyAll)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetBreakpoint) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetBreakpoint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClearBreakpoint) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(ClearBreakpoint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetNamedModule) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetNamedModule)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetFieldAccessWatch) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetFieldAccessWatch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClearFieldAccessWatch) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(ClearFieldAccessWatch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetFieldModificationWatch) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetFieldModificationWatch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClearFieldModificationWatch) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(ClearFieldModificationWatch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsModifiableClass) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(IsModifiableClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Allocate) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(Allocate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Deallocate) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(Deallocate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetClassSignature) as usize - ptr as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetClassSignature)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetClassStatus) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetClassStatus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSourceFileName) as usize - ptr as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetSourceFileName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetClassModifiers) as usize - ptr as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetClassModifiers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetClassMethods) as usize - ptr as usize },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetClassMethods)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetClassFields) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetClassFields)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetImplementedInterfaces) as usize - ptr as usize },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetImplementedInterfaces)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsInterface) as usize - ptr as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(IsInterface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsArrayClass) as usize - ptr as usize },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(IsArrayClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetClassLoader) as usize - ptr as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetClassLoader)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetObjectHashCode) as usize - ptr as usize },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetObjectHashCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetObjectMonitorUsage) as usize - ptr as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetObjectMonitorUsage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetFieldName) as usize - ptr as usize },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetFieldName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetFieldDeclaringClass) as usize - ptr as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetFieldDeclaringClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetFieldModifiers) as usize - ptr as usize },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetFieldModifiers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsFieldSynthetic) as usize - ptr as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(IsFieldSynthetic)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetMethodName) as usize - ptr as usize },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetMethodName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetMethodDeclaringClass) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetMethodDeclaringClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetMethodModifiers) as usize - ptr as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetMethodModifiers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved67) as usize - ptr as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(reserved67)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetMaxLocals) as usize - ptr as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetMaxLocals)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetArgumentsSize) as usize - ptr as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetArgumentsSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetLineNumberTable) as usize - ptr as usize },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetLineNumberTable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetMethodLocation) as usize - ptr as usize },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetMethodLocation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetLocalVariableTable) as usize - ptr as usize },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetLocalVariableTable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetNativeMethodPrefix) as usize - ptr as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetNativeMethodPrefix)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetNativeMethodPrefixes) as usize - ptr as usize },
        584usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetNativeMethodPrefixes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetBytecodes) as usize - ptr as usize },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetBytecodes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsMethodNative) as usize - ptr as usize },
        600usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(IsMethodNative)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsMethodSynthetic) as usize - ptr as usize },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(IsMethodSynthetic)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetLoadedClasses) as usize - ptr as usize },
        616usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetLoadedClasses)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetClassLoaderClasses) as usize - ptr as usize },
        624usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetClassLoaderClasses)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PopFrame) as usize - ptr as usize },
        632usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(PopFrame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ForceEarlyReturnObject) as usize - ptr as usize },
        640usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(ForceEarlyReturnObject)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ForceEarlyReturnInt) as usize - ptr as usize },
        648usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(ForceEarlyReturnInt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ForceEarlyReturnLong) as usize - ptr as usize },
        656usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(ForceEarlyReturnLong)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ForceEarlyReturnFloat) as usize - ptr as usize },
        664usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(ForceEarlyReturnFloat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ForceEarlyReturnDouble) as usize - ptr as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(ForceEarlyReturnDouble)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ForceEarlyReturnVoid) as usize - ptr as usize },
        680usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(ForceEarlyReturnVoid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RedefineClasses) as usize - ptr as usize },
        688usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(RedefineClasses)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetVersionNumber) as usize - ptr as usize },
        696usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetVersionNumber)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetCapabilities) as usize - ptr as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetCapabilities)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSourceDebugExtension) as usize - ptr as usize },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetSourceDebugExtension)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsMethodObsolete) as usize - ptr as usize },
        720usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(IsMethodObsolete)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SuspendThreadList) as usize - ptr as usize },
        728usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SuspendThreadList)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResumeThreadList) as usize - ptr as usize },
        736usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(ResumeThreadList)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AddModuleReads) as usize - ptr as usize },
        744usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(AddModuleReads)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AddModuleExports) as usize - ptr as usize },
        752usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(AddModuleExports)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AddModuleOpens) as usize - ptr as usize },
        760usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(AddModuleOpens)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AddModuleUses) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(AddModuleUses)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AddModuleProvides) as usize - ptr as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(AddModuleProvides)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsModifiableModule) as usize - ptr as usize },
        784usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(IsModifiableModule)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetAllStackTraces) as usize - ptr as usize },
        792usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetAllStackTraces)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetThreadListStackTraces) as usize - ptr as usize },
        800usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetThreadListStackTraces)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetThreadLocalStorage) as usize - ptr as usize },
        808usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetThreadLocalStorage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetThreadLocalStorage) as usize - ptr as usize },
        816usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetThreadLocalStorage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStackTrace) as usize - ptr as usize },
        824usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetStackTrace)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved105) as usize - ptr as usize },
        832usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(reserved105)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetTag) as usize - ptr as usize },
        840usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetTag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetTag) as usize - ptr as usize },
        848usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetTag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ForceGarbageCollection) as usize - ptr as usize },
        856usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(ForceGarbageCollection)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).IterateOverObjectsReachableFromObject) as usize
                - ptr as usize
        },
        864usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(IterateOverObjectsReachableFromObject)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IterateOverReachableObjects) as usize - ptr as usize },
        872usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(IterateOverReachableObjects)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IterateOverHeap) as usize - ptr as usize },
        880usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(IterateOverHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IterateOverInstancesOfClass) as usize - ptr as usize },
        888usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(IterateOverInstancesOfClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved113) as usize - ptr as usize },
        896usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(reserved113)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetObjectsWithTags) as usize - ptr as usize },
        904usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetObjectsWithTags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FollowReferences) as usize - ptr as usize },
        912usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(FollowReferences)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IterateThroughHeap) as usize - ptr as usize },
        920usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(IterateThroughHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved117) as usize - ptr as usize },
        928usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(reserved117)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SuspendAllVirtualThreads) as usize - ptr as usize },
        936usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SuspendAllVirtualThreads)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResumeAllVirtualThreads) as usize - ptr as usize },
        944usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(ResumeAllVirtualThreads)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetJNIFunctionTable) as usize - ptr as usize },
        952usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetJNIFunctionTable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetJNIFunctionTable) as usize - ptr as usize },
        960usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetJNIFunctionTable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEventCallbacks) as usize - ptr as usize },
        968usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetEventCallbacks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GenerateEvents) as usize - ptr as usize },
        976usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GenerateEvents)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetExtensionFunctions) as usize - ptr as usize },
        984usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetExtensionFunctions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetExtensionEvents) as usize - ptr as usize },
        992usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetExtensionEvents)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetExtensionEventCallback) as usize - ptr as usize },
        1000usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetExtensionEventCallback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DisposeEnvironment) as usize - ptr as usize },
        1008usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(DisposeEnvironment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetErrorName) as usize - ptr as usize },
        1016usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetErrorName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetJLocationFormat) as usize - ptr as usize },
        1024usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetJLocationFormat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSystemProperties) as usize - ptr as usize },
        1032usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetSystemProperties)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSystemProperty) as usize - ptr as usize },
        1040usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetSystemProperty)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetSystemProperty) as usize - ptr as usize },
        1048usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetSystemProperty)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetPhase) as usize - ptr as usize },
        1056usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetPhase)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).GetCurrentThreadCpuTimerInfo) as usize - ptr as usize
        },
        1064usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetCurrentThreadCpuTimerInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetCurrentThreadCpuTime) as usize - ptr as usize },
        1072usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetCurrentThreadCpuTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetThreadCpuTimerInfo) as usize - ptr as usize },
        1080usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetThreadCpuTimerInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetThreadCpuTime) as usize - ptr as usize },
        1088usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetThreadCpuTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetTimerInfo) as usize - ptr as usize },
        1096usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetTimerInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetTime) as usize - ptr as usize },
        1104usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetPotentialCapabilities) as usize - ptr as usize },
        1112usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetPotentialCapabilities)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved141) as usize - ptr as usize },
        1120usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(reserved141)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AddCapabilities) as usize - ptr as usize },
        1128usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(AddCapabilities)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RelinquishCapabilities) as usize - ptr as usize },
        1136usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(RelinquishCapabilities)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetAvailableProcessors) as usize - ptr as usize },
        1144usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetAvailableProcessors)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetClassVersionNumbers) as usize - ptr as usize },
        1152usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetClassVersionNumbers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetConstantPool) as usize - ptr as usize },
        1160usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetConstantPool)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetEnvironmentLocalStorage) as usize - ptr as usize },
        1168usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetEnvironmentLocalStorage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEnvironmentLocalStorage) as usize - ptr as usize },
        1176usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetEnvironmentLocalStorage)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).AddToBootstrapClassLoaderSearch) as usize - ptr as usize
        },
        1184usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(AddToBootstrapClassLoaderSearch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetVerboseFlag) as usize - ptr as usize },
        1192usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetVerboseFlag)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).AddToSystemClassLoaderSearch) as usize - ptr as usize
        },
        1200usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(AddToSystemClassLoaderSearch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RetransformClasses) as usize - ptr as usize },
        1208usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(RetransformClasses)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).GetOwnedMonitorStackDepthInfo) as usize - ptr as usize
        },
        1216usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetOwnedMonitorStackDepthInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetObjectSize) as usize - ptr as usize },
        1224usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetObjectSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetLocalInstance) as usize - ptr as usize },
        1232usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(GetLocalInstance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetHeapSamplingInterval) as usize - ptr as usize },
        1240usize,
        concat!(
            "Offset of field: ",
            stringify!(jvmtiInterface_1_),
            "::",
            stringify!(SetHeapSamplingInterval)
        )
    );
}
impl Default for jvmtiInterface_1_ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type jvmtiInterface_1 = jvmtiInterface_1_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _jvmtiEnv {
    pub functions: *const jvmtiInterface_1_,
}
#[test]
fn bindgen_test_layout__jvmtiEnv() {
    const UNINIT: ::std::mem::MaybeUninit<_jvmtiEnv> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_jvmtiEnv>(),
        8usize,
        concat!("Size of: ", stringify!(_jvmtiEnv))
    );
    assert_eq!(
        ::std::mem::align_of::<_jvmtiEnv>(),
        8usize,
        concat!("Alignment of ", stringify!(_jvmtiEnv))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).functions) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_jvmtiEnv),
            "::",
            stringify!(functions)
        )
    );
}
impl Default for _jvmtiEnv {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
